Обработки/Reports/_ПереченьСделокИДвиженияДенежныхСредств_ГруппаБудущее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ПереченьСделокИДвиженияДенежныхСредств_ГруппаБудущее</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВФорматеCSV</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ПереченьСделокИДвиженияДенежныхСредств_ГруппаБудущее/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Перечень сделок и движения денежных средств (Группа Будущее)",
		"0.25",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	МассивСчетовДУ = МассивСчетовДУДляОтчета();
	Если Не ПроверитьСчетаДоверительногоУправленияДляОтчета(МассивСчетовДУ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ВФорматеCSV Тогда
		Если Не ПроверитьКаталог() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка отменена");
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ИмяПредопределенногоВарианта = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект);
			
	Настройки = КомпоновщикНастроек.Настройки;
	Параметры = Настройки.ПараметрыДанных;
	
	Параметры.УстановитьЗначениеПараметра("ДатаНачала",						ЭтотОбъект.Период.ДатаНачала);
	Параметры.УстановитьЗначениеПараметра("ДатаОкончания",					КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Параметры.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);	
	Параметры.УстановитьЗначениеПараметра("СчетаДоверительногоУправления", 	МассивСчетовДУ);
		
	Если ЭтотОбъект.ВФорматеCSV Тогда
		
		// Получаем выгрузку, сохраняем в файл
		
		СтандартнаяОбработка = Ложь;
		
		ТекстРезультата = ПолучитьВыгрузкуСРазделителем(МассивСчетовДУ);   	
	
		ИмяФайла = ЭтотОбъект.КаталогДанных + "\" + ПолучитьИмяФайла() + ".csv";
		
		ТекстРезультата.Записать(ИмяФайла, "windows-1251");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка завершена");
	
	Иначе
		
		// Выполняем программную компоновку
		РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);	
	КонецЕсли;
		
КонецПроцедуры

Функция ПроверитьКаталог()
		
	ТекФайл = Новый Файл(ЭтотОбъект.КаталогДанных);
	Если Не ТекФайл.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указанный каталог не существует");
		Возврат Ложь;
	КонецЕсли;
		   		
	Если Не ТекФайл.ЭтоКаталог() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Указан файл, а не каталог");
		Возврат Ложь;                                                               	
	КонецЕсли;
	
	Если ТекФайл.ПолучитьТолькоЧтение() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсутствует доступ к указанному каталогу");
		Возврат Ложь;                                                               	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьИмяФайла()
	
	ИмяФайла = "Перечень сделок и ДДС ";
	
	Если ЭтотОбъект.ПоКлиенту Тогда
		Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);
		ИмяФайла = ИмяФайла + СокрЛП(Клиент);
	Иначе
		ИмяФайла = ИмяФайла + СокрЛП(ЭтотОбъект.СчетДоверительногоУправления);
	КонецЕсли;
	
	Если ЭтотОбъект.Период.ДатаНачала = НачалоДня(ЭтотОбъект.Период.ДатаОкончания) Тогда
		ИмяФайла = ИмяФайла + "_" + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy");
	Иначе	
		ИмяФайла = ИмяФайла + "_" + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + "_" + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ПолучитьВыгрузкуСРазделителем(МассивСчетовДУ)
	
	ИмяПредопределенногоВарианта = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтотОбъект);
			
	Настройки = КомпоновщикНастроек.Настройки;
	Параметры = Настройки.ПараметрыДанных;
	
	Параметры.УстановитьЗначениеПараметра("ДатаНачала",						ЭтотОбъект.Период.ДатаНачала);
	Параметры.УстановитьЗначениеПараметра("ДатаОкончания",					КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Параметры.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);	
	Параметры.УстановитьЗначениеПараметра("СчетаДоверительногоУправления", 	МассивСчетовДУ);
	
	ПолноеИмяОтчета = ЭтотОбъект.Метаданные().ПолноеИмя();
	СессияСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессиюКомпоновкиСКД(ЭтотОбъект, ПолноеИмяОтчета);	
	
	// Стандартная компоновка отчета	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных,  ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки(),,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);
	                          
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
		
	ТекстРезультата = Новый ТекстовыйДокумент;
	
	НоваяСтрока = "Номер сделки;Вид имущества;Номер и дата договора;Наименование фонда;Краткое наименование инструмента;Тип актива;Номер расчетного счета, по которому произошло движение ДС;Рег. номер;ISIN;Дата операции/дата заключения сделки;Дата оплаты;Тип транзакции;Сумма без НКД;НКД, руб.;Сумма с НКД, руб.;Количество;Комиссия биржи;Комиссия брокера;Доп. информация";
	
	ТекстРезультата.ДобавитьСтроку(НоваяСтрока);
	
	КоличествоКолонок = ТаблицаРезультата.Колонки.Количество() - 1;

	НомерКолонкиЦеннойБумаги = ТаблицаРезультата.Колонки.Индекс(ТаблицаРезультата.Колонки.Найти("ЦеннаяБумага"));
	
	Для Каждого СтрокаТаблицы Из ТаблицаРезультата Цикл
		
		НоваяСтрока = "";
		Для СчКолонок = 0 По КоличествоКолонок Цикл
			Если СчКолонок = НомерКолонкиЦеннойБумаги Тогда
				//	реализуем представление из СКД
				Если СтрокаТаблицы.ТипАктива = "Процентный своп" Тогда
					ЗначениеЯчейки = "СВОП, " + СтрокаТаблицы.ЦеннаяБумага.НомерСделки + ", " + Формат(СтрокаТаблицы.ЦеннаяБумага.ДатаИсполнения, "ДФ=dd.MM.yyyy");
				Иначе	
					ЗначениеЯчейки = Строка(СтрокаТаблицы.ЦеннаяБумага);
				КонецЕсли;
			Иначе				
				ЗначениеЯчейки = СокрЛП(СтрокаТаблицы.Получить(СчКолонок));
			КонецЕсли;
			НоваяСтрока = НоваяСтрока + ЗначениеЯчейки + ?(СчКолонок = КоличествоКолонок, "", ";");
		КонецЦикла;
		
		ТекстРезультата.ДобавитьСтроку(НоваяСтрока);
		
	КонецЦикла;
	
	// Завершаем сессию сбора статистики
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(ПолноеИмяОтчета, СессияСбораСтатистики); 	
	
	Возврат ТекстРезультата;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ВариантОтчета");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтотОбъект, НастройкиОтчета.ВариантОтчета);
	
	МассивСчетовДУ = МассивСчетовДУДляОтчета();
	Если Не ПроверитьСчетаДоверительногоУправленияДляОтчета(МассивСчетовДУ) Тогда
		НастройкиОтчета.Вставить("Отказ");
		Возврат;
	КонецЕсли;
	
	ТекстРезультата = ПолучитьВыгрузкуСРазделителем(МассивСчетовДУ);   	
	
	ИмяВремФайла = ПолучитьИмяВременногоФайла(".csv");
	
	ТекстРезультата.Записать(ИмяВремФайла, "windows-1251");
			
	АдресРезультатаВХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВремФайла), Новый УникальныйИдентификатор());
			
	НастройкиОтчета.Вставить("Результат", АдресРезультатаВХранилище);
	
	УдалитьФайлы(ИмяВремФайла);
	
КонецПроцедуры

Функция ПроверитьСчетаДоверительногоУправленияДляОтчета(МассивСчетовДУ)
	
	Отказ = Ложь;
	
	// Проверяем дату запрета редактирования проводок ЕПС
	Запрос = Новый Запрос;		
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Период", 								НачалоДня(ЭтотОбъект.Период.ДатаОкончания));	
	Запрос.УстановитьПараметр("Организация", 							ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления", 			МассивСчетовДУ);
			
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления
	    |ПОМЕСТИТЬ _СчетаДоверительногоУправления
	    |ИЗ
	    |	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
	    |ГДЕ
	    |	СчетаДоверительногоУправления.Ссылка В(&СчетаДоверительногоУправления)";
		
	Запрос.Выполнить();
	
	Отказ = РаботаСОтчетами.ЕстьДатыЗапретаРедактированияСчетовДоверительногоУправленияДоДатыПроверки(Запрос.МенеджерВременныхТаблиц, ЭтотОбъект.Период.ДатаОкончания, ЭтотОбъект.Организация, Перечисления.ГруппыЗапретаРедактирования.БэкОфис);
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет не сформирован");
	КонецЕсли;

	Возврат Не Отказ;
	
КонецФункции

Функция МассивСчетовДУДляОтчета()
	
	Результат = Новый Массив;
	Если Не ЭтотОбъект.ПоКлиенту Тогда
		Результат.Добавить(ЭтотОбъект.СчетДоверительногоУправления);
	Иначе
		Клиент = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаОкончания);
		ТаблицаСчетовДУ = Справочники.СчетаДоверительногоУправления.СчетаДоверительногоУправленияНаДатуСАктивами(ЭтотОбъект.Период.ДатаОкончания, Новый Структура("Клиент", Клиент));
		Если ТипЗнч(ТаблицаСчетовДУ) = Тип("ТаблицаЗначений") Тогда
			Результат = ТаблицаСчетовДУ.ВыгрузитьКолонку("СчетДоверительногоУправления");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
